# IdeaStatiCa.ConnectionApi.Model.WeldDefinition
Weld definition for cut operations (web or flange weld).

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Thickness** | **double** | Thickness of the weld - value 0 &#x3D; recommended size | [optional]
**WeldType** | **WeldType** |  | [optional]
**WeldMaterial** | **ReferenceElement** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)